const stars = [
  // переулки между плотно стоящими зданиями
  { x:  26, y: 20, z:  26 },   // между (20,20) h=18 и (32,20) h=26
  { x:  26, y: 26, z:  26 },   // выше
  { x:  26, y: 18, z: -20 },   // между (20,32) h=14 и (32,32) h=32
  // "коридоры" между рядами зданий
  { x:  10, y: 22, z:  20 },
  { x: -10, y: 26, z:  25 },
  { x:  40, y: 32, z: -10 },   // над отдельной башней h=24
  { x: -40, y: 36, z: -30 },   // над h=26
  { x:   5, y: 30, z:  55 },   // между (0,60) h=18 и (35,55) h=22
  { x: -20, y: 42, z: -55 },   // над h=32
  { x:   0, y: 50, z:   0 },   // центральная башня h=40
  { x:  55, y: 26, z:  30 },   // над h=20
  { x: -50, y: 34, z:   5 },   // над h=28
];

export const city = {
  name: 'Город',
  description: 'Плотная застройка. 12 звёзд — часть в переулках между башнями.',
  mode: 'stars',
  skyColor: 0x9ab8d8,
  groundColor: 0x2b2b30,
  groundBump: 0.15,
  sunColor: 0xffe8c0,
  sunIntensity: 1.1,
  hemiIntensity: 0.5,
  ambIntensity: 0.35,
  spawn: { x: 0, y: 15, z: 90, yaw: 0 },
  trees: [],
  buildings: [
    { x:  20, z:  20, w: 8,  h: 18, d: 8,  color: 0x6b7078 },
    { x:  32, z:  20, w: 6,  h: 26, d: 6,  color: 0x707880 },
    { x:  20, z:  32, w: 10, h: 14, d: 10, color: 0x5e646c },
    { x:  32, z:  32, w: 6,  h: 32, d: 6,  color: 0x778088 },
    { x: -30, z:  25, w: 10, h: 22, d: 10, color: 0x6b7078 },
    { x: -42, z:  25, w: 8,  h: 30, d: 8,  color: 0x707880 },
    { x: -30, z: -30, w: 12, h: 26, d: 12, color: 0x5e646c },
    { x: -42, z: -30, w: 8,  h: 34, d: 8,  color: 0x778088 },
    { x:  40, z: -10, w: 8,  h: 24, d: 8,  color: 0x6b7078 },
    { x:  55, z:  30, w: 10, h: 20, d: 10, color: 0x707880 },
    { x: -50, z:   5, w: 8,  h: 28, d: 8,  color: 0x5e646c },
    { x: -20, z: -55, w: 10, h: 32, d: 10, color: 0x778088 },
    { x:  70, z: -20, w: 6,  h: 22, d: 6,  color: 0x6b7078 },
    { x: -65, z: -10, w: 6,  h: 26, d: 6,  color: 0x707880 },
    { x:   0, z:   0, w: 12, h: 40, d: 12, color: 0x808890 },
    { x:   0, z:  60, w: 8,  h: 18, d: 8,  color: 0x6b7078 },
    { x:  35, z:  55, w: 8,  h: 22, d: 8,  color: 0x707880 },
  ],
  stars,
  rings: [],
};